In [3]:
import pandas as pd

df = pd.read_csv("titanic.csv")

print(df)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]

In [67]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [68]:
df.head(6)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

In [69]:
df.loc[99]

PassengerId                  100
Survived                       0
Pclass                         2
Name           Kantor, Mr. Sinai
Sex                         male
Age                         34.0
SibSp                          1
Parch                          0
Ticket                    244367
Fare                        26.0
Cabin                        NaN
Embarked                       S
Name: 99, dtype: object

In [70]:
df.at[5, 'Age'] = 28.0
df.head(6)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,28.0,0,0,330877,8.4583,NaN,Q

In [71]:
count = 0
for i in range(0, len(df)):
    if(df.iloc[i]['Age'] > 18):
        count+=1
print(count)

576

In [72]:
male = 0
for j in range(0, len(df)):
    if(df.iloc[j]['Sex'] == 'male'):
        male+=1
total = len(df)
percentage = male/total
print(percentage * 100)

64.75869809203144

In [73]:
'''
percentage = df.crosstab(index=df['Embarked'], columns='count')
percentage/percentage.sum()
'''
ports = []
ports.append(df.loc[0,'Embarked'])
ports

['S']

In [74]:
classes = {"CLASS":[], "Frequency":[], }
countFirst = 0
countSecond = 0
countThird =0
for ticket in df["Pclass"]:
    if( ticket ==1):
        countFirst +=1
    elif ticket ==2:
        countSecond = countSecond +1
    elif countThird ==3:
        countThird +=1
classes["CLASS"].append("First")
classes["CLASS"].append("Second")
classes["CLASS"].append("Ihird")
classes["Frequency"].append(countFirst)
classes["Frequency"].append(countSecond)
classes["Frequency"].append(countThird)

In [75]:
freqTable = pd.DataFrame(classes)
freqTable.head()

    CLASS  Frequency
0   First        216
1  Second        184
2   Ihird          0

In [81]:
freqTable = pd.DataFrame(classes)
freqTable["Percent"] = (freqTable["Frclasses"] == {"CLASS":[], "Frequency":[], }
freqTable.value_counts()

SyntaxError: invalid syntax (2878175649.py, line 3)

In [77]:
df[df['PassengerId'] == 528]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
527,528,0,1,"Farthing, Mr. John",male,NaN,0,0,PC 17483,221.7792,C95,S

In [78]:
index=0
for person in df['Name']:
    if "Fannie" in person:
        break
    index+= 1
df.loc[index]

PassengerId                              707
Survived                                   1
Pclass                                     2
Name           Kelly, Mrs. Florence "Fannie"
Sex                                   female
Age                                     45.0
SibSp                                      0
Parch                                      0
Ticket                                223596
Fare                                    13.5
Cabin                                    NaN
Embarked                                   S
Name: 706, dtype: object

In [85]:
con = pd.crosstab(df['Sex'], df['Survived']==1)
con

Survived  False  True
Sex
female       81   233
male        468   109

In [89]:
ms =0
fs=0
md=0
fd=0
for ind in range(len(df)):
    if (df.loc[ind]['Sex'] == "male"):
        if(df.loc[ind]['Survived'] == 1):
            ms += 1
        else:
            md +=1
    else:
        if(df.loc[ind]['Survived'] == 1):
            fs+=1
        else:
            fd+=1
malexftalbe = pd.dataframe({"Male": [ms,md], "Female": [fs,fd]}, index = ["Male", "Female"])
malexf = pd.crosstab(df['Male'], df['Female']
malexf

SyntaxError: invalid syntax (1426071428.py, line 18)

In [97]:
data ={"Elderly":[], "Not Elderly":[]}
eldd = 0
elds =0
yous=0
youd = 0
#group = pd.DataFrame(data, index = ["Sruvived","Not Survived"])
for ini in range(len(df)):
    if(df.loc[ini]["Age"] >= 60):
        if(df.loc[ini]["Survived"]):
            elds+=1
        else:
            eldd +=1
    else:
        if(df.loc[ini]["Survived"]):
            yous+=1
        else:
            youd+=1
        
conTable = {
    "Not Elderly": [yous, youd],
    "Elderly": [elds, eldd]
    
}
df2 = pd.DataFrame(conTable)
df2.index = ["Survived", "Died"]
print(df2)

          Not Elderly  Elderly
Survived          335        7
Died              530       19

child =0
adult=0
old = 0
for i in range(len(df)):
    if(df.loc[i]["Age"] < 18):
        child +=1
    elif(df.loc[i]["Age"] >=60):
        old +=1
    else:
        adult +=1
childp = child/(child+old+adult)
adultp = adult/(child+old+adult)
oldp= old/(child+old+adult)
spread = pd.DataFrame({"Child":[childp], "Adult":[adultp], "Elderly": [oldp]})

cross = spread.crosstab(spread["Child"], spread["Adult"], spread["Elderly"], index: 
print(crosstab)

In [102]:
child =0
adult=0
old = 0
for i in range(len(df)):
    if(df.loc[i]["Age"] < 18):
        child +=1
    elif(df.loc[i]["Age"] >=60):
        old +=1
    else:
        adult +=1
childp = child/(child+old+adult)*100
adultp = adult/(child+old+adult)*100
oldp= old/(child+old+adult)*100
spread = pd.DataFrame({"Child":[childp], "Adult":[adultp], "Elderly": [oldp]})

cross = pd.crosstab(spread["Child"], spread["Adult"], spread["Elderly"])
print(crosstab)

ValueError: values cannot be used without an aggfunc.

In [103]:
import pandas as pd

child = 0
adult = 0
old = 0

for i in range(len(df)):
    if df.loc[i, "Age"] < 18:
        child += 1
    elif df.loc[i, "Age"] >= 60:
        old += 1
    else:
        adult += 1


total = child + adult + old


childp = child / total * 100
adultp = adult / total * 100
oldp = old / total * 100


spread = pd.DataFrame({
    "Child": [childp],
    "Adult": [adultp],
    "Elderly": [oldp]
})


print(spread)

       Child      Adult  Elderly
0  12.682379  84.399551  2.91807

In [ ]:
survival = {"CITY": [], "SURVIVAL": []}
died = {}
citySsurvived = 0
cityCsurvived =0
cityQsurvived =0
for i in range(len(df)):
    if(df.loc[i]["Embarked"] == "S"):
        citySsurvived += 1
    elif(df.loc[i]["Embarked"] == "C"):
        cityCsurvived +=1
    else:
        cityQsurvived +=1
percentS = citySsurvived
survival = {"CITY": [city], "SURVIVAL": []}

In [7]:
diedkey = {}
survivedkey = {}
for i in range(len(df)):
    port = df.loc[i, "Embarked"]
    survived = df.loc[i, "Survived"]
    if (survived==1):
        if(port in survivedkey.keys()):
            survivedkey[port] += 1
        else:
            survivedkey[port] = 1
    else:
        if(port in diedkey.keys()):
            diedkey[port] += 1
        else:
            diedkey[port] = 1
    
    
contable = {
    "S" : [survivedkey["S"]/(survivedkey["S"] + diedkey["S"]), diedkey["S"]/(survivedkey["S"] + diedkey["S"])],
    "Q" : [survivedkey["Q"]/(survivedkey["Q"] + diedkey["Q"]), diedkey["Q"]/(survivedkey["Q"] + diedkey["Q"])],
    "C" : [survivedkey["C"]/(survivedkey["C"] + diedkey["C"]), diedkey["C"]/(survivedkey["C"] + diedkey["C"])]
}
printtable = pd.DataFrame(contable)
printtable.index = ["Survivede" , "Died"]
printtable

                  S        Q         C
Survivede  0.336957  0.38961  0.553571
Died       0.663043  0.61039  0.446429